MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1024EFE100/mcu.h
extern volatile __SBT1WR0bits_t SBT1WR0bits __asm__ ("SBT1WR0") __attribute__((section("sfrs"), address(0xBF8F8458)));
#define SBT1REG2 SBT1REG2
extern volatile uint32_t   SBT1REG2 __attribute__((section("sfrs"), address(0xBF8F8480)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT1REG2bits_t;
extern volatile __SBT1REG2bits_t SBT1REG2bits __asm__ ("SBT1REG2") __attribute__((section("sfrs"), address(0xBF8F8480)));
#define SBT1RD2 SBT1RD2
extern volatile uint32_t   SBT1RD2 __attribute__((section("sfrs"), address(0xBF8F8490)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT1RD2bits_t;
extern volatile __SBT1RD2bits_t SBT1RD2bits __asm__ ("SBT1RD2") __attribute__((section("sfrs"), address(0xBF8F8490)));
#define SBT1WR2 SBT1WR2
extern volatile uint32_t   SBT1WR2 __attribute__((section("sfrs"), address(0xBF8F8498)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT1WR2bits_t;
extern volatile __SBT1WR2bits_t SBT1WR2bits __asm__ ("SBT1WR2") __attribute__((section("sfrs"), address(0xBF8F8498)));
#define SBT1REG3 SBT1REG3
extern volatile uint32_t   SBT1REG3 __attribute__((section("sfrs"), address(0xBF8F84A0)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT1REG3bits_t;
extern volatile __SBT1REG3bits_t SBT1REG3bits __asm__ ("SBT1REG3") __attribute__((section("sfrs"), address(0xBF8F84A0)));
#define SBT1RD3 SBT1RD3
extern volatile uint32_t   SBT1RD3 __attribute__((section("sfrs"), address(0xBF8F84B0)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT1RD3bits_t;
extern volatile __SBT1RD3bits_t SBT1RD3bits __asm__ ("SBT1RD3") __attribute__((section("sfrs"), address(0xBF8F84B0)));
#define SBT1WR3 SBT1WR3
extern volatile uint32_t   SBT1WR3 __attribute__((section("sfrs"), address(0xBF8F84B8)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT1WR3bits_t;
extern volatile __SBT1WR3bits_t SBT1WR3bits __asm__ ("SBT1WR3") __attribute__((section("sfrs"), address(0xBF8F84B8)));
#define SBT1REG4 SBT1REG4
extern volatile uint32_t   SBT1REG4 __attribute__((section("sfrs"), address(0xBF8F84C0)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT1REG4bits_t;
extern volatile __SBT1REG4bits_t SBT1REG4bits __asm__ ("SBT1REG4") __attribute__((section("sfrs"), address(0xBF8F84C0)));
#define SBT1RD4 SBT1RD4
extern volatile uint32_t   SBT1RD4 __attribute__((section("sfrs"), address(0xBF8F84D0)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT1RD4bits_t;
extern volatile __SBT1RD4bits_t SBT1RD4bits __asm__ ("SBT1RD4") __attribute__((section("sfrs"), address(0xBF8F84D0)));
#define SBT1WR4 SBT1WR4
extern volatile uint32_t   SBT1WR4 __attribute__((section("sfrs"), address(0xBF8F84D8)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT1WR4bits_t;
extern volatile __SBT1WR4bits_t SBT1WR4bits __asm__ ("SBT1WR4") __attribute__((section("sfrs"), address(0xBF8F84D8)));
#define SBT1REG5 SBT1REG5
extern volatile uint32_t   SBT1REG5 __attribute__((section("sfrs"), address(0xBF8F84E0)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT1REG5bits_t;
extern volatile __SBT1REG5bits_t SBT1REG5bits __asm__ ("SBT1REG5") __attribute__((section("sfrs"), address(0xBF8F84E0)));
#define SBT1RD5 SBT1RD5
extern volatile uint32_t   SBT1RD5 __attribute__((section("sfrs"), address(0xBF8F84F0)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT1RD5bits_t;
extern volatile __SBT1RD5bits_t SBT1RD5bits __asm__ ("SBT1RD5") __attribute__((section("sfrs"), address(0xBF8F84F0)));
#define SBT1WR5 SBT1WR5
extern volatile uint32_t   SBT1WR5 __attribute__((section("sfrs"), address(0xBF8F84F8)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT1WR5bits_t;
extern volatile __SBT1WR5bits_t SBT1WR5bits __asm__ ("SBT1WR5") __attribute__((section("sfrs"), address(0xBF8F84F8)));
#define SBT1REG6 SBT1REG6
extern volatile uint32_t   SBT1REG6 __attribute__((section("sfrs"), address(0xBF8F8500)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT1REG6bits_t;
extern volatile __SBT1REG6bits_t SBT1REG6bits __asm__ ("SBT1REG6") __attribute__((section("sfrs"), address(0xBF8F8500)));
#define SBT1RD6 SBT1RD6
extern volatile uint32_t   SBT1RD6 __attribute__((section("sfrs"), address(0xBF8F8510)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT1RD6bits_t;
extern volatile __SBT1RD6bits_t SBT1RD6bits __asm__ ("SBT1RD6") __attribute__((section("sfrs"), address(0xBF8F8510)));
#define SBT1WR6 SBT1WR6
extern volatile uint32_t   SBT1WR6 __attribute__((section("sfrs"), address(0xBF8F8518)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT1WR6bits_t;
extern volatile __SBT1WR6bits_t SBT1WR6bits __asm__ ("SBT1WR6") __attribute__((section("sfrs"), address(0xBF8F8518)));
#define SBT1REG7 SBT1REG7
extern volatile uint32_t   SBT1REG7 __attribute__((section("sfrs"), address(0xBF8F8520)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT1REG7bits_t;
extern volatile __SBT1REG7bits_t SBT1REG7bits __asm__ ("SBT1REG7") __attribute__((section("sfrs"), address(0xBF8F8520)));
#define SBT1RD7 SBT1RD7
extern volatile uint32_t   SBT1RD7 __attribute__((section("sfrs"), address(0xBF8F8530)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT1RD7bits_t;
extern volatile __SBT1RD7bits_t SBT1RD7bits __asm__ ("SBT1RD7") __attribute__((section("sfrs"), address(0xBF8F8530)));
#define SBT1WR7 SBT1WR7
extern volatile uint32_t   SBT1WR7 __attribute__((section("sfrs"), address(0xBF8F8538)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT1WR7bits_t;
extern volatile __SBT1WR7bits_t SBT1WR7bits __asm__ ("SBT1WR7") __attribute__((section("sfrs"), address(0xBF8F8538)));
#define SBT1REG8 SBT1REG8
extern volatile uint32_t   SBT1REG8 __attribute__((section("sfrs"), address(0xBF8F8540)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT1REG8bits_t;
extern volatile __SBT1REG8bits_t SBT1REG8bits __asm__ ("SBT1REG8") __attribute__((section("sfrs"), address(0xBF8F8540)));
#define SBT1RD8 SBT1RD8
extern volatile uint32_t   SBT1RD8 __attribute__((section("sfrs"), address(0xBF8F8550)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT1RD8bits_t;
extern volatile __SBT1RD8bits_t SBT1RD8bits __asm__ ("SBT1RD8") __attribute__((section("sfrs"), address(0xBF8F8550)));
#define SBT1WR8 SBT1WR8
extern volatile uint32_t   SBT1WR8 __attribute__((section("sfrs"), address(0xBF8F8558)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT1WR8bits_t;
extern volatile __SBT1WR8bits_t SBT1WR8bits __asm__ ("SBT1WR8") __attribute__((section("sfrs"), address(0xBF8F8558)));
#define SBT2ELOG1 SBT2ELOG1
extern volatile uint32_t   SBT2ELOG1 __attribute__((section("sfrs"), address(0xBF8F8820)));
typedef struct {
  uint32_t CMD:3;
  uint32_t :1;
  uint32_t REGION:4;
  uint32_t INITID:8;
  uint32_t :8;
  uint32_t CODE:4;
  uint32_t :3;
  uint32_t MULTI:1;
} __SBT2ELOG1bits_t;
extern volatile __SBT2ELOG1bits_t SBT2ELOG1bits __asm__ ("SBT2ELOG1") __attribute__((section("sfrs"), address(0xBF8F8820)));
#define SBT2ELOG2 SBT2ELOG2
extern volatile uint32_t   SBT2ELOG2 __attribute__((section("sfrs"), address(0xBF8F8824)));
typedef struct {
  uint32_t GROUP:2;
} __SBT2ELOG2bits_t;
extern volatile __SBT2ELOG2bits_t SBT2ELOG2bits __asm__ ("SBT2ELOG2") __attribute__((section("sfrs"), address(0xBF8F8824)));
#define SBT2ECON SBT2ECON
extern volatile uint32_t   SBT2ECON __attribute__((section("sfrs"), address(0xBF8F8828)));
typedef struct {
  uint32_t :24;
  uint32_t ERRP:1;
} __SBT2ECONbits_t;
extern volatile __SBT2ECONbits_t SBT2ECONbits __asm__ ("SBT2ECON") __attribute__((section("sfrs"), address(0xBF8F8828)));
#define SBT2ECLRS SBT2ECLRS
extern volatile uint32_t   SBT2ECLRS __attribute__((section("sfrs"), address(0xBF8F8830)));
typedef struct {
  uint32_t CLEAR:1;
} __SBT2ECLRSbits_t;
